m-okada/QV08/emu/ARM/kinetis_workspace/Q8Emu_KV58_SDK12/SDK/platform/hal/src/sim/MKV58F22/fsl_sim_hal_MKV58F22.h
/*
 * Copyright (c) 2014 - 2015, Freescale Semiconductor, Inc.
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * o Redistributions of source code must retain the above copyright notice, this list
 *   of conditions and the following disclaimer.
 *
 * o Redistributions in binary form must reproduce the above copyright notice, this
 *   list of conditions and the following disclaimer in the documentation and/or
 *   other materials provided with the distribution.
 *
 * o Neither the name of Freescale Semiconductor, Inc. nor the names of its
 *   contributors may be used to endorse or promote products derived from this
 *   software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
 * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR
 * ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
 * (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
 * LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON
 * ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
 * SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#if !defined(__FSL_SIM_HAL_MKV58F22_H__)
#define __FSL_SIM_HAL_MKV58F22_H__

/*! @addtogroup sim_hal*/
/*! @{*/
#include "fsl_sim_hal.h"
/*! @file*/

/*******************************************************************************
 * Definitions
 ******************************************************************************/

/*! @brief WDOG clock source select */
typedef enum _clock_wdog_src_t
{
    kClockWdogSrcLpoClk,       /*!< LPO                                          */
    kClockWdogSrcAltClk,       /*!< Alternative clock, for K64F12 it is Bus clock. */
} clock_wdog_src_t;

/*! @brief Debug trace clock source select */
typedef enum _clock_trace_src_t
{
    kClockTraceSrcMcgoutClk,       /*!< MCG out clock  */
    kClockTraceSrcCoreClk,         /*!< core clock     */
} clock_trace_src_t;

/*! @brief Debug trace clock source select */
typedef enum _clock_nanoedge_clk2x_src
{
    kClockNanoedgeSrcMcgPllClk,       /*!< MCG out clock  */
    kClockNanoedgeSrcMcgPllClk2x,         /*!< core clock     */
} clock_nanoedge_clk2x_src;

/*! @brief SIM OSC32KSEL clock source select */
typedef enum _sim_osc32k_clock_sel
{
    kSimOsc32kSelOsc32k,      /* OSC 32k clock */
    kSimOsc32kSelReserved,    /* Reserved */
    kSimOsc32kSelReserved1,   /* Reserved */
    kSimOsc32kSelLpo          /* LPO clock */
} sim_osc32k_clock_sel_t;

/*! @brief SIM NANOEDGECLK2XSEL clock source select */
typedef enum _sim_nanoedge_clock_sel
{
    kSimNanoEdgeMcgPllClk,    /* MCG PLL clock */
    kSimNanoEdgeMcgPll2xClk,  /* MCG PLL 2X clock */
} sim_nanoedge_clock_sel_t;

/*! @brief SIM TRACECLKSEL clock source select */
typedef enum _sim_trace_clock_sel
{
    kSimTraceMcgoutClk,       /* MCG out clock */
    kSimTraceCoreClk          /* core clock */
} sim_trace_clock_sel_t;

/*! @brief SIM HSADC trigger select */
typedef enum _sim_hsadc_trg_sel
{
    kSimHsadcTrgselPdb0Ext        = 0U,    /* PDB0_EXTRG for HSADC0A and HSADC1B                        */
    kSimHsadcTrgSelHighSpeedComp0 = 1U,    /* High speed comparator 0 output                            */
    kSimHsadcTrgSelHighSpeedComp1 = 2U,    /* High speed comparator 1 output                            */
    kSimHsadcTrgSelHighSpeedComp2 = 3U,    /* High speed comparator 2 output                            */
    kSimHsadcTrgSelPit0           = 4U,    /* PIT trigger 0                                             */
    kSimHsadcTrgSelPit1           = 5U,    /* PIT trigger 1                                             */
    kSimHsadcTrgSelPit2           = 6U,    /* PIT trigger 2                                             */
    kSimHsadcTrgSelPit3           = 7U,    /* PIT trigger 3                                             */
    kSimHsadcTrgSelFtm0           = 8U,    /* FTM0 trigger                                              */
    kSimHsadcTrgSelFtm1           = 9U,    /* FTM1 trigger                                              */
    kSimHsadcTrgSelFtm2           = 10U,   /* FTM2 trigger                                              */
    kSimHsadcTrgSelFtm3           = 11U,   /* FTM3 trigger                                              */
    kSimHsadcTrgSelxbaraout       = 12U,   /* XBARAOUT38 for HSADC0A, 1B and XBARAOUT41 for HSADC0B, 1A */
    kSimHsadcTrgSelLptimer        = 14U,   /* Low-power timer trigger                                   */
} sim_hsadc_trg_sel_t;

/*! @brief SIM ADCx trigger select */
typedef enum _sim_adc_trg_sel
{
    kSimAdcTrgselPdb0Ext          = 0U,    /*!< PDB0_EXTRG external trigger    */
    kSimAdcTrgSelHighSpeedComp0   = 1U,    /*!< High speed comparator 0 output */
    kSimAdcTrgSelHighSpeedComp1   = 2U,    /*!< High speed comparator 1 output */
    kSimAdcTrgSelHighSpeedComp2   = 3U,    /*!< High speed comparator 2 output */
    kSimAdcTrgSelPit0             = 4U,    /*!< PIT trigger 0                  */
    kSimAdcTrgSelPit1             = 5U,    /*!< PIT trigger 1                  */
    kSimAdcTrgSelPit2             = 6U,    /*!< PIT trigger 2                  */
    kSimAdcTrgSelPit3             = 7U,    /*!< PIT trigger 3                  */
    kSimAdcTrgSelFtm0             = 8U,    /*!< FTM0 trigger                   */
    kSimAdcTrgSelFtm1             = 9U,    /*!< FTM1 trigger                   */
    kSimAdcTrgSelFtm2             = 10U,   /*!< FTM2 trigger                   */
    kSimAdcTrgSelFtm3             = 11U,   /*!< FTM3 trigger                   */
    kSimAdcTrgSelxbaraout         = 12U,   /*!< XBARAOUT38                     */
    kSimAdcTrgSelLptimer          = 14U,   /*!< Low-power timer trigger        */
#if (defined(DOXYGEN_OUTPUT) && (DOXYGEN_OUTPUT))
} sim_adc_trg_sel_kv58f22_t;
#else
} sim_adc_trg_sel_t;
#endif

/*!
 * @brief Defines the type of enumerating HSADC converter's ID.
 */
typedef enum _sim_hsadc_conv_id
{
    kSimHsadcConvA = 0U,/*!< ID for HSADC converter A. */
    kSimHsadcConvB = 1U /*!< ID for HSADC converter B. */
} sim_hsadc_conv_id_t;

/*! @brief SIM HSADC alternate trigger enable */
typedef enum _sim_hsadc_alttrg_sel_t
{
    kSimHsadcTrgenXbarout        = 0U,    /* XBARAOUT12, 13, 42, 43 for HSADC0A, 0B, 1A, 1B    */
    kSimHsadcTrgenPdb            = 1U,    /* PDB0CH0, 1CH1, 1CH1, 0Ch1 for HSADC0A, 0B, 1A, 1B */
    kSimHsadcTrgselALT           = 2U     /* alternate trigger                                 */
} sim_hsadc_alttrg_sel_t;

/*! @brief SIM SIM ADCx alternative conversion trigger select */
typedef enum _sim_adc_alttrg_sel
{
    kSimAdcAltTrgselXbarout    = 0U,  /*!< XBARAOUT29          */
    kSimAdcAltTrgselPDB0       = 1U,  /*!< PDB0 channel 1      */
    kSimAdcAltTrgselPDB1       = 2U,  /*!< PDB1 channel 0      */
    kSimAdcAltTrgselALT        = 3U,  /*!< Alternative trigger */
#if (defined(DOXYGEN_OUTPUT) && (DOXYGEN_OUTPUT))
} sim_adc_alttrg_sel_kv58f22_t;
#else
} sim_adc_alttrg_sel_t;
#endif

