m-okada/QV08/emu/ARM/kinetis_workspace/Q8Emu_KV58_SDK12/SDK/platform/hal/src/sim/MKV58F22/fsl_sim_hal_MKV58F22.h
#if FSL_FEATURE_SIM_FCFG_HAS_MAXADDR1
/*!
 * @brief Gets the Flash maximum address block 1 in Flash Configuration Register 2.
 *
 * This function  gets the Flash maximum block 1 in Flash Configuration Register 1.
 *
 * @param base     Base address for current SIM instance.
 * @return address Flash maximum block 0 address
 */
static inline uint32_t SIM_HAL_GetFlashMaxAddrBlock1(SIM_Type* base)
{
    return SIM_BRD_FCFG2_MAXADDR1(base);
}
#endif

#if FSL_FEATURE_SIM_FCFG_HAS_MAXADDR01
/*!
 * @brief Gets the Flash maximum address block 0 in the Flash Configuration Register 1  (SIM_FCFG).
 *
 * This function  gets the Flash maximum block 0 in Flash Configuration Register 2.
 *
 * @param base     Base address for current SIM instance.
 * @return address Flash maximum block 0 address
 */
static inline uint32_t SIM_HAL_GetFlashMaxAddrBlock01(SIM_Type* base)
{
    return SIM_BRD_FCFG2_MAXADDR01(base);
}
#endif

#if FSL_FEATURE_SIM_FCFG_HAS_MAXADDR23
/*!
 * @brief Gets the Flash maximum address block 1 in the Flash Configuration Register 2.
 *
 * This function  gets the Flash maximum block 1 in Flash Configuration Register 1.
 *
 * @param base Base address for current SIM instance.
 * @return address Flash maximum block 0 address
 */
static inline uint32_t SIM_HAL_GetFlashMaxAddrBlock23(SIM_Type* base)
{
    return SIM_BRD_FCFG2_MAXADDR23(base);
}
#endif

#if FSL_FEATURE_SIM_FCFG_HAS_PFLSH
/*!
 * @brief Gets the program flash in the Flash Configuration Register 2.
 *
 * This function  gets the program flash maximum block 0 in Flash Configuration Register 1.
 *
 * @param base Base address for current SIM instance.
 * @return status program flash status
 */
static inline uint32_t SIM_HAL_GetProgramFlashCmd(SIM_Type* base)
{
    return SIM_BRD_FCFG2_PFLSH(base);
}
#endif

/*!
 * @brief Sets the Debug Trace Divider Control.
 *
 * This function  sets the Debug Trace Divider enable setting.
 *
 * @param base     Base address for current SIM instance.
 * @param enable       Debug trace divider control enable setting
 */
static inline void SIM_HAL_SetDebugTraceDivEnCmd(SIM_Type* base, bool enable)
{
    SIM_BWR_CLKDIV4_TRACEDIVEN(base, enable);
}

/*!
 * @brief Gets the Debug Trace Divider Control.
 *
 * This function  gets the Debug Trace Divider enable setting.
 *
 * @param base     Base address for current SIM instance.
 * @return enable      Debug trace divider control enable setting
 */
static inline bool SIM_HAL_GetDebugTraceDivEnCmd(SIM_Type* base)
{
    return (bool)SIM_BRD_CLKDIV4_TRACEDIVEN(base);
}

/*!
 * @brief Sets the Debug Trace Divider Divisor.
 *
 * This function  sets the Debug Trace Divider Divisor value.
 *
 * @param base     Base address for current SIM instance.
 * @param divisor_value       divide value for the fractional clock divider
 */
static inline void SIM_HAL_SetDebugTraceDivDivisor(SIM_Type* base, uint8_t divisor_value)
{
    SIM_BWR_CLKDIV4_TRACEDIV(base, divisor_value);
}

/*!
 * @brief Gets the Debug Trace Divider Divisor value.
 *
 * This function  gets the Debug Trace Divider enable setting.
 *
 * @param base     Base address for current SIM instance.
 * @return divisor_value      divide value for the fractional clock divider
 */
static inline uint8_t SIM_HAL_GetDebugTraceDivDivisor(SIM_Type* base)
{
    return (bool)SIM_BRD_CLKDIV4_TRACEDIV(base);
}

/*!
 * @brief Sets the Debug Trace Divider Divisor.
 *
 * This function  sets the Debug Trace Divider Divisor value.
 *
 * @param base     Base address for current SIM instance.
 * @param divisor_frac_value       divide value for the fractional clock divider
 */
static inline void SIM_HAL_SetDebugTraceFracDivDivisor(SIM_Type* base, bool divisor_frac_value)
{
    SIM_BWR_CLKDIV4_TRACEFRAC(base, divisor_frac_value);
}

/*!
 * @brief Gets the Debug Trace Divider Divisor value.
 *
 * This function  gets the Debug Trace Divider enable setting.
 *
 * @param base     Base address for current SIM instance.
 * @return divisor_frac_value      divide value for the fractional clock divider
 */
static inline uint8_t SIM_HAL_GetDebugTraceFracDivDivisor(SIM_Type* base)
{
    return (bool)SIM_BRD_CLKDIV4_TRACEFRAC(base);
}

/*!
 * @brief Enable the clock for specific module.
 *
 * This function enables the clock for specific module.
 *
 * @param base Base address for current SIM instance.
 * @param name Name of the module to enable.
 */
static inline void SIM_HAL_EnableClock(SIM_Type* base, sim_clock_gate_name_t name)
{
    SIM_BWR_SCGC_BIT(base, name, 1U);
}

/*!
 * @brief Disable the clock for specific module.
 *
 * This function disables the clock for specific module.
 *
 * @param base Base address for current SIM instance.
 * @param name Name of the module to disable.
 */
static inline void SIM_HAL_DisableClock(SIM_Type* base, sim_clock_gate_name_t name)
{
    SIM_BWR_SCGC_BIT(base, name, 0U);
}

/*!
 * @brief Get the the clock gate state for specific module.
 *
 * This function will get the clock gate state for specific module.
 *
 * @param base Base address for current SIM instance.
 * @param name Name of the module to get.
 * @return state true - ungated(Enabled), false - gated (Disabled)
 */
static inline bool SIM_HAL_GetGateCmd(SIM_Type* base, sim_clock_gate_name_t name)
{
    return (bool)SIM_BRD_SCGC_BIT(base, name);
}

/*! @name IP related clock feature APIs*/
/*@{*/
/*!
 * @brief Set OUTDIV1.
 *
 * This function sets divide value OUTDIV1.
 *
 * @param base Base address for current SIM instance.
 * @param setting  The value to set.
 */
static inline void CLOCK_HAL_SetOutDiv1(SIM_Type* base, uint8_t setting)
{
    SIM_BWR_CLKDIV1_OUTDIV1(base, setting);
}

/*!
 * @brief Get OUTDIV1.
 *
 * This function gets divide value OUTDIV1.
 *
 * @param base Base address for current SIM instance.
 * @return Current divide value.
 */
static inline uint8_t CLOCK_HAL_GetOutDiv1(SIM_Type* base)
{
    return SIM_BRD_CLKDIV1_OUTDIV1(base);
}

/*!
 * @brief Set OUTDIV2.
 *
 * This function sets divide value OUTDIV2.
 *
 * @param base Base address for current SIM instance.
 * @param setting  The value to set.
 */
static inline void CLOCK_HAL_SetOutDiv2(SIM_Type* base, uint8_t setting)
{
    SIM_BWR_CLKDIV1_OUTDIV2(base, setting);
}

/*!
 * @brief Get OUTDIV2.
 *
 * This function gets divide value OUTDIV2.
 *
 * @param base Base address for current SIM instance.
 * @return Current divide value.
 */
static inline uint8_t CLOCK_HAL_GetOutDiv2(SIM_Type* base)
{
    return SIM_BRD_CLKDIV1_OUTDIV2(base);
}

/*!
 * @brief Set OUTDIV3.
 *
 * This function sets divide value OUTDIV3.
 *
 * @param base Base address for current SIM instance.
 * @param setting  The value to set.
 */
static inline void CLOCK_HAL_SetOutDiv3(SIM_Type* base, uint8_t setting)
{
    SIM_BWR_CLKDIV1_OUTDIV3(base, setting);
}

/*!
 * @brief Get OUTDIV3.
 *
 * This function gets divide value OUTDIV3.
 *
 * @param base Base address for current SIM instance.
 * @return Current divide value.
 */
static inline uint8_t CLOCK_HAL_GetOutDiv3(SIM_Type* base)
{
    return SIM_BRD_CLKDIV1_OUTDIV3(base);
}

/*!
 * @brief Set OUTDIV4.
 *
 * This function sets divide value OUTDIV4.
 *
 * @param base Base address for current SIM instance.
 * @param setting  The value to set.
 */
static inline void CLOCK_HAL_SetOutDiv4(SIM_Type* base, uint8_t setting)
{
    SIM_BWR_CLKDIV1_OUTDIV4(base, setting);
}

/*!
 * @brief Get OUTDIV4.
 *
 * This function gets divide value OUTDIV4.
 *
 * @param base Base address for current SIM instance.
 * @return Current divide value.
 */
static inline uint8_t CLOCK_HAL_GetOutDiv4(SIM_Type* base)
{
    return SIM_BRD_CLKDIV1_OUTDIV4(base);
}

/*!
 * @brief Enable the clock for DMA module.
 *
 * This function enables the clock for DMA module.
 *
 * @param base Base address for current SIM instance.
 * @param instance module device instance
 */
void SIM_HAL_EnableDmaClock(SIM_Type* base, uint32_t instance);

/*!
 * @brief Disable the clock for DMA module.
 *
 * This function disables the clock for DMA module.
 *
 * @param base Base address for current SIM instance.
 * @param instance module device instance
 */
void SIM_HAL_DisableDmaClock(SIM_Type* base, uint32_t instance);

/*!
 * @brief Get the the clock gate state for DMA module.
 *
 * This function will get the clock gate state for DMA module.
 *
 * @param base Base address for current SIM instance.
 * @param instance module device instance
 * @return state true - ungated(Enabled), false - gated (Disabled)
 */
bool SIM_HAL_GetDmaGateCmd(SIM_Type* base, uint32_t instance);

/*!
 * @brief Enable the clock for DMAMUX module.
 *
 * This function enables the clock for DMAMUX module.
 *
 * @param base Base address for current SIM instance.
 * @param instance module device instance
 */
void SIM_HAL_EnableDmamuxClock(SIM_Type* base, uint32_t instance);

/*!
 * @brief Disable the clock for DMAMUX module.
 *
 * This function disables the clock for DMAMUX module.
 *
 * @param base Base address for current SIM instance.
 * @param instance module device instance
 */
void SIM_HAL_DisableDmamuxClock(SIM_Type* base, uint32_t instance);

/*!
 * @brief Get the the clock gate state for DMAMUX module.
 *
 * This function will get the clock gate state for DMAMUX module.
 *
 * @param base Base address for current SIM instance.
 * @param instance module device instance
 * @return state true - ungated(Enabled), false - gated (Disabled)
 */
bool SIM_HAL_GetDmamuxGateCmd(SIM_Type* base, uint32_t instance);

/*!
 * @brief Enable the clock for PORT module.
 *
 * This function enables the clock for PORT module.
 *
 * @param base Base address for current SIM instance.
 * @param instance module device instance
 */
void SIM_HAL_EnablePortClock(SIM_Type* base, uint32_t instance);

/*!
 * @brief Disable the clock for PORT module.
 *
 * This function disables the clock for PORT module.
 *
 * @param base Base address for current SIM instance.
 * @param instance module device instance
 */
void SIM_HAL_DisablePortClock(SIM_Type* base, uint32_t instance);

/*!
 * @brief Get the the clock gate state for PORT module.
 *
 * This function will get the clock gate state for PORT module.
 *
 * @param base Base address for current SIM instance.
 * @param instance module device instance
 * @return state true - ungated(Enabled), false - gated (Disabled)
 */
bool SIM_HAL_GetPortGateCmd(SIM_Type* base, uint32_t instance);


/*!
 * @brief Enable the clock for EWM module.
 *
 * This function enables the clock for EWM module.
 *
 * @param base Base address for current SIM instance.
 * @param instance module device instance
 */
void SIM_HAL_EnableEwmClock(SIM_Type* base, uint32_t instance);

/*!
 * @brief Disable the clock for EWM module.
 *
 * This function disables the clock for EWM module.
 *
 * @param base Base address for current SIM instance.
 * @param instance module device instance
 */
void SIM_HAL_DisableEwmClock(SIM_Type* base, uint32_t instance);

/*!
 * @brief Get the the clock gate state for EWM module.
 *
 * This function will get the clock gate state for EWM module.
 *
 * @param base Base address for current SIM instance.
 * @param instance module device instance
 * @return state true - ungated(Enabled), false - gated (Disabled)
 */
bool SIM_HAL_GetEwmGateCmd(SIM_Type* base, uint32_t instance);


/*!
 * @brief Enable the clock for FTF module.
 *
 * This function enables the clock for FTF module.
 *
 * @param base Base address for current SIM instance.
 * @param instance module device instance
 */
void SIM_HAL_EnableFtfClock(SIM_Type* base, uint32_t instance);

/*!
 * @brief Disable the clock for FTF module.
 *
 * This function disables the clock for FTF module.
 *
 * @param base Base address for current SIM instance.
 * @param instance module device instance
 */
void SIM_HAL_DisableFtfClock(SIM_Type* base, uint32_t instance);

/*!
 * @brief Get the the clock gate state for FTF module.
 *
 * This function will get the clock gate state for FTF module.
 *
 * @param base Base address for current SIM instance.
 * @param instance module device instance
 * @return state true - ungated(Enabled), false - gated (Disabled)
 */
bool SIM_HAL_GetFtfGateCmd(SIM_Type* base, uint32_t instance);

/*!
 * @brief Enable the clock for CRC module.
 *
 * This function enables the clock for CRC module.
 *
 * @param base Base address for current SIM instance.
 * @param instance module device instance
 */
void SIM_HAL_EnableCrcClock(SIM_Type* base, uint32_t instance);

/*!
 * @brief Disable the clock for CRC module.
 *
 * This function disables the clock for CRC module.
 *
 * @param base Base address for current SIM instance.
 * @param instance module device instance
 */
void SIM_HAL_DisableCrcClock(SIM_Type* base, uint32_t instance);

/*!
 * @brief Get the the clock gate state for CRC module.
 *
 * This function will get the clock gate state for CRC module.
 *
 * @param base Base address for current SIM instance.
 * @param instance module device instance
 * @return state true - ungated(Enabled), false - gated (Disabled)
 */
bool SIM_HAL_GetCrcGateCmd(SIM_Type* base, uint32_t instance);


/*!
 * @brief Enable the clock for ADC module.
 *
 * This function enables the clock for ADC module.
 *
 * @param base Base address for current SIM instance.
 * @param instance module device instance
 */
void SIM_HAL_EnableAdcClock(SIM_Type* base, uint32_t instance);

/*!
 * @brief Disable the clock for ADC module.
 *
 * This function disables the clock for ADC module.
 *
 * @param base Base address for current SIM instance.
 * @param instance module device instance
 */
void SIM_HAL_DisableAdcClock(SIM_Type* base, uint32_t instance);

/*!
 * @brief Get the the clock gate state for ADC module.
 *
 * This function will get the clock gate state for ADC module.
 *
 * @param base Base address for current SIM instance.
 * @param instance module device instance
 * @return state true - ungated(Enabled), false - gated (Disabled)
 */
bool SIM_HAL_GetAdcGateCmd(SIM_Type* base, uint32_t instance);

/*!
 * @brief Enable the clock for CMP module.
 *
 * This function enables the clock for CMP module.
 *
 * @param base Base address for current SIM instance.
 * @param instance module device instance
 */
void SIM_HAL_EnableCmpClock(SIM_Type* base, uint32_t instance);

/*!
 * @brief Disable the clock for CMP module.
 *
 * This function disables the clock for CMP module.
 *
 * @param base Base address for current SIM instance.
 * @param instance module device instance
 */
void SIM_HAL_DisableCmpClock(SIM_Type* base, uint32_t instance);

/*!
 * @brief Get the the clock gate state for CMP module.
 *
 * This function will get the clock gate state for CMP module.
 *
 * @param base Base address for current SIM instance.
 * @param instance module device instance
 * @return state true - ungated(Enabled), false - gated (Disabled)
 */
bool SIM_HAL_GetCmpGateCmd(SIM_Type* base, uint32_t instance);

/*!
 * @brief Enable the clock for DAC module.
 *
 * This function enables the clock for DAC module.
 *
 * @param base Base address for current SIM instance.
 * @param instance module device instance
 */
void SIM_HAL_EnableDacClock(SIM_Type* base, uint32_t instance);

/*!
 * @brief Disable the clock for DAC module.
 *
 * This function disables the clock for DAC module.
 *
 * @param base Base address for current SIM instance.
 * @param instance module device instance
 */
void SIM_HAL_DisableDacClock(SIM_Type* base, uint32_t instance);

/*!
 * @brief Get the the clock gate state for DAC module.
 *
 * This function will get the clock gate state for DAC module.
 *
 * @param base Base address for current SIM instance.
 * @param instance module device instance
 * @return state true - ungated(Enabled), false - gated (Disabled)
 */
bool SIM_HAL_GetDacGateCmd(SIM_Type* base, uint32_t instance);

/*!
 * @brief Enable the clock for PDB module.
 *
 * This function enables the clock for PDB module.
 *
 * @param base Base address for current SIM instance.
 * @param instance module device instance
 */
void SIM_HAL_EnablePdbClock(SIM_Type* base, uint32_t instance);

/*!
 * @brief Disable the clock for PDB module.
 *
 * This function disables the clock for PDB module.
 *
 * @param base Base address for current SIM instance.
 * @param instance module device instance
 */
void SIM_HAL_DisablePdbClock(SIM_Type* base, uint32_t instance);

/*!
 * @brief Get the the clock gate state for PDB module.
 *
 * This function will get the clock gate state for PDB module.
 *
 * @param base Base address for current SIM instance.
 * @param instance module device instance
 * @return state true - ungated(Enabled), false - gated (Disabled)
 */
bool SIM_HAL_GetPdbGateCmd(SIM_Type* base, uint32_t instance);

/*!
 * @brief Enable the clock for FTM module.
 *
 * This function enables the clock for FTM module.
 *
 * @param base Base address for current SIM instance.
 * @param instance module device instance
 */
void SIM_HAL_EnableFtmClock(SIM_Type* base, uint32_t instance);

/*!
 * @brief Disable the clock for FTM module.
 *
 * This function disables the clock for FTM module.
 *
 * @param base Base address for current SIM instance.
 * @param instance module device instance
 */
void SIM_HAL_DisableFtmClock(SIM_Type* base, uint32_t instance);

/*!
 * @brief Get the the clock gate state for FTM module.
 *
 * This function will get the clock gate state for FTM module.
 *
 * @param base Base address for current SIM instance.
 * @param instance module device instance
 * @return state true - ungated(Enabled), false - gated (Disabled)
 */
bool SIM_HAL_GetFtmGateCmd(SIM_Type* base, uint32_t instance);

/*!
 * @brief Set Nanoedge Regulator 1.2 V Supply Standby Control
 *
 * This function controls the standby mode of the 1.2 V supply from the nanoedge voltage regulator.
 *
 * @param base Base address for current SIM instance.
 * @param select:
 * 00 Nanoedge regulator 1.2 V supply placed in normal mode
 * 01 Nanoedge regulator 1.2 V supply placed in standby mode.
 * 10 Nanoedge regulator 1.2 V supply placed in normal mode and SR12STDBY is write protected until
 * chip reset.
 * 11 Nanoedge regulator 1.2 V supply placed in standby mode and SR12STDBY is write protected until
 * chip reset.
 *
 *END**************************************************************************/
void SIM_HAL_SetNanoedgeRegulator12SupStdbyControl(SIM_Type* base, uint8_t select);

/*!
 *
 * @brief Get Nanoedge Regulator 1.2 V Supply Standby Control
 *
 * This function will get the standby mode of the 1.2 V supply from the nanoedge voltage regulator
 * @param base Base address for current SIM instance.
 * @return select:
 * 00 Nanoedge regulator 1.2 V supply placed in normal mode
 * 01 Nanoedge regulator 1.2 V supply placed in standby mode.
 * 10 Nanoedge regulator 1.2 V supply placed in normal mode and SR12STDBY is write protected until
 * chip reset.
 * 11 Nanoedge regulator 1.2 V supply placed in standby mode and SR12STDBY is write protected until
 * chip reset.
 *
 *END**************************************************************************/
uint8_t SIM_HAL_GetNanoedgeRegulator12SupStdbyControl(SIM_Type* base);

/*!
 * @brief Set Nanoedge Regulator 2.7 V Supply Standby Control
 *
 * This function controls the standby mode of the 2.7 V supply from the nanoedge voltage regulator.
 * 
 * @param base Base address for current SIM instance.
 * @param select:
 * 00 Nanoedge regulator 2.7 V supply placed in normal mode
 * 01 Nanoedge regulator 2.7 V supply placed in standby mode.
 * 10 Nanoedge regulator 2.7 V supply placed in normal mode and SR12STDBY is write protected until
 * chip reset.
 * 11 Nanoedge regulator 2.7 V supply placed in standby mode and SR12STDBY is write protected until
 * chip reset.
 *
 *
 *END**************************************************************************/
void SIM_HAL_SetNanoedgeRegulator27SupStdbyControl(SIM_Type* base, uint8_t select);

/*!
 * @brief Get Nanoedge Regulator 2.7 V Supply Standby Control
 *
 * This function will get the standby mode of the 2.7 V supply from the nanoedge voltage regulator.
 * 
 * @param base Base address for current SIM instance.
 * @return select:
 * 00 Nanoedge regulator 2.7 V supply placed in normal mode
 * 01 Nanoedge regulator 2.7 V supply placed in standby mode.
 * 10 Nanoedge regulator 2.7 V supply placed in normal mode and SR12STDBY is write protected until
 * chip reset.
 * 11 Nanoedge regulator 2.7 V supply placed in standby mode and SR12STDBY is write protected until
 * chip reset.
 *
 *
 *END**************************************************************************/
uint8_t SIM_HAL_GetNanoedgeRegulator27SupStdbyControl(SIM_Type* base);

/*!
 *
 * @brief Set Nanoedge Regulator 2.7V and 1.2V Supply Powerdown Control
 *
 * This function controls the powerdown mode of the 2.7V and 1.2V supply from the nanoedge voltage regulator
 * 
 * @param base Base address for current SIM instance.
 * @param select:
 * 00 Nanoedge regulator placed in normal mode.
 * 01 Nanoedge regulator placed in powerdown mode.
 * 10 Nanoedge regulator placed in normal mode and SRPDN is write protected until chip reset.
 * 11 Nanoedge regulator placed in powerdown mode and SRPDN is write protected until chip reset.
 *
 *END**************************************************************************/
void SIM_HAL_SetNanoedgeReg27n12SupPwrdwnControl(SIM_Type* base, uint8_t select);

/*!
 *
 * @brief Get Nanoedge Regulator 2.7V and 1.2V Supply Powerdown Control
 *
 * This function gets the the powerdown mode of the 2.7V and 1.2V supply from the nanoedge voltage regulator
 * 
 * @param base Base address for current SIM instance.
 * @return select:
 * 00 Nanoedge regulator placed in normal mode.
 * 01 Nanoedge regulator placed in powerdown mode.
 * 10 Nanoedge regulator placed in normal mode and SRPDN is write protected until chip reset.
 * 11 Nanoedge regulator placed in powerdown mode and SRPDN is write protected until chip reset.
 *
 *END**************************************************************************/
uint8_t SIM_HAL_GetNanoedgeReg27n12SupPwrdwnControl(SIM_Type* base);

/*!
 *
 * @brief WDOG Clock Select
 *
 * This function selects the clock source of the WDOG2008 watchdog.
 * 
 * @param base Base address for current SIM instance.
 * @param select:
 * 0 Internal 1 kHz clock is source to WDOG2008
 * 1 MCGIRCLK is source to WDOG2008
 *
 *END**************************************************************************/
void SIM_HAL_SetWdogClkSrc(SIM_Type* base, bool select);

/*!
 *
 * @brief Get WDOG Clock Src
 *
 * This function gets the clock source of the WDOG2008 watchdog.
 * 
 * @param base Base address for current SIM instance.
 * @return select:
 * 0 Internal 1 kHz clock is source to WDOG2008
 * 1 MCGIRCLK is source to WDOG2008
 *
 *END**************************************************************************/
bool SIM_HAL_GetWdogClkSrc(SIM_Type* base);

/*!
 *
 * @brief Synchronize XBARA's Input PIT Trigger X with fast clock 
 * 
 * This function enables the synchronizer between PIT trigger X and XBARA's input.
 *
 * @param base Base address for current SIM instance.
 * @param instance Pit trigger number
 *END**************************************************************************/
void SIM_HAL_EnableSyncXbarAPittrigX(SIM_Type* base, uint32_t instance);

